Repository: alexbigi/cursor_test_flutter
Catalog: lib/l10n/app_*.arb
Languages: be, ru

# appTitle
source: Todo App
be: Спіс спраў
ru: Список дел

# todos
source: {count, plural, =0{No todos}=1{1 todo}other{{count} todos}}
be: {count, plural, =0{Няма спраў}=1{1 справа}other{{count} спраў}}
ru: {count, plural, =0{Нет дел}=1{1 дело}other{{count} дел}}

source: Add Todo
be: Дадаць справу
ru: Добавить дело

source: Add
be: Дадаць
ru: Добавить

source: Edit Todo
be: Рэдагаваць справу
ru: Редактировать дело

source: Delete Todo
be: Выдаліць справу
ru: Удалить дело

source: Mark as completed
be: Адзначыць як выкананае
ru: Отметить как выполненное

source: Mark as incomplete
be: Адзначыць як невыкананае
ru: Отметить как невыполненное

source: Title
be: Назва
ru: Название

# titleHint
source: Enter todo title
be: Увядзіце назву справы
ru: Введите название дела

source: Description
be: Апісанне
ru: Описание

# descriptionHint
source: Enter todo description
be: Увядзіце апісанне справы
ru: Введите описание дела

source: Save
be: Захаваць
ru: Сохранить

source: Cancel
be: Адмена
ru: Отмена

source: Error
be: Памылка
ru: Ошибка

source: Error loading todos
be: Памылка загрузкі спраў
ru: Ошибка загрузки дел

source: Error saving todo
be: Памылка захавання справы
ru: Ошибка сохранения дела

source: Error deleting todo
be: Памылка выдалення справы
ru: Ошибка удаления дела

# noTodos
source: No todos yet
be: Няма спраў
ru: Нет дел

source: Todo deleted
be: Справа выдалена
ru: Дело удалено

source: Undo
be: Адмяніць
ru: Отменить

source: Retry
be: Паўтарыць
ru: Повторить
